socialNetwork/wrk2/test-run-with-istio-final/COMMAND_18/54
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 1493.734ms, rate sampling interval: 4726ms
  Thread calibration: mean lat.: 1520.135ms, rate sampling interval: 4722ms
  Thread calibration: mean lat.: 1512.858ms, rate sampling interval: 4665ms
  Thread calibration: mean lat.: 1409.667ms, rate sampling interval: 4562ms
  Thread calibration: mean lat.: 1427.035ms, rate sampling interval: 4595ms
  Thread calibration: mean lat.: 1526.798ms, rate sampling interval: 4689ms
  Thread calibration: mean lat.: 1533.833ms, rate sampling interval: 4517ms
  Thread calibration: mean lat.: 1520.414ms, rate sampling interval: 4673ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.24s   610.33ms   4.81s    66.85%
    Req/Sec   153.47     16.01   176.00     76.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.14s 
 75.000%    3.64s 
 90.000%    4.13s 
 99.000%    4.81s 
 99.900%    5.00s 
 99.990%    5.17s 
 99.999%    5.21s 
100.000%    5.22s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1859.583     0.000000            1         1.00
    2533.375     0.100000         6243         1.11
    2709.503     0.200000        12402         1.25
    2863.103     0.300000        18587         1.43
    2998.271     0.400000        24809         1.67
    3143.679     0.500000        30967         2.00
    3221.503     0.550000        34109         2.22
    3303.423     0.600000        37209         2.50
    3393.535     0.650000        40263         2.86
    3504.127     0.700000        43386         3.33
    3635.199     0.750000        46471         4.00
    3702.783     0.775000        47999         4.44
    3778.559     0.800000        49562         5.00
    3860.479     0.825000        51125         5.71
    3946.495     0.850000        52641         6.67
    4036.607     0.875000        54211         8.00
    4079.615     0.887500        54961         8.89
    4130.815     0.900000        55756        10.00
    4186.111     0.912500        56524        11.43
    4247.551     0.925000        57309        13.33
    4321.279     0.937500        58083        16.00
    4370.431     0.943750        58458        17.78
    4419.583     0.950000        58842        20.00
    4472.831     0.956250        59232        22.86
    4521.983     0.962500        59617        26.67
    4579.327     0.968750        59987        32.00
    4612.095     0.971875        60179        35.56
    4640.767     0.975000        60380        40.00
    4669.439     0.978125        60569        45.71
    4702.207     0.981250        60776        53.33
    4739.071     0.984375        60974        64.00
    4755.455     0.985938        61053        71.11
    4780.031     0.987500        61164        80.00
    4796.415     0.989062        61251        91.43
    4816.895     0.990625        61345       106.67
    4841.471     0.992188        61448       128.00
    4853.759     0.992969        61493       142.22
    4866.047     0.993750        61533       160.00
    4882.431     0.994531        61595       182.86
    4894.719     0.995313        61633       213.33
    4911.103     0.996094        61689       256.00
    4915.199     0.996484        61704       284.44
    4923.391     0.996875        61729       320.00
    4931.583     0.997266        61753       365.71
    4939.775     0.997656        61775       426.67
    4952.063     0.998047        61807       512.00
    4956.159     0.998242        61811       568.89
    4964.351     0.998437        61823       640.00
    4976.639     0.998633        61838       731.43
    4984.831     0.998828        61847       853.33
    5005.311     0.999023        61861      1024.00
    5017.599     0.999121        61865      1137.78
    5033.983     0.999219        61872      1280.00
    5050.367     0.999316        61877      1462.86
    5070.847     0.999414        61883      1706.67
    5091.327     0.999512        61889      2048.00
    5099.519     0.999561        61892      2275.56
    5107.711     0.999609        61897      2560.00
    5115.903     0.999658        61900      2925.71
    5124.095     0.999707        61903      3413.33
    5132.287     0.999756        61904      4096.00
    5136.383     0.999780        61906      4551.11
    5144.575     0.999805        61908      5120.00
    5152.767     0.999829        61909      5851.43
    5156.863     0.999854        61910      6826.67
    5165.055     0.999878        61912      8192.00
    5169.151     0.999890        61913      9102.22
    5169.151     0.999902        61913     10240.00
    5181.439     0.999915        61915     11702.86
    5181.439     0.999927        61915     13653.33
    5193.727     0.999939        61916     16384.00
    5193.727     0.999945        61916     18204.44
    5193.727     0.999951        61916     20480.00
    5201.919     0.999957        61917     23405.71
    5201.919     0.999963        61917     27306.67
    5210.111     0.999969        61918     32768.00
    5210.111     0.999973        61918     36408.89
    5210.111     0.999976        61918     40960.00
    5210.111     0.999979        61918     46811.43
    5210.111     0.999982        61918     54613.33
    5222.399     0.999985        61919     65536.00
    5222.399     1.000000        61919          inf
#[Mean    =     3243.854, StdDeviation   =      610.328]
#[Max     =     5218.304, Total count    =        61919]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75513 requests in 1.00m, 15.48MB read
Requests/sec:   1258.57
Transfer/sec:    264.25KB